//========================================
// 
// UI:アイテムアイコン[00] のヘッダファイル
// Author:RIKU NISHIMURA
// 
//========================================
//  *** ui_item-icon_00.h ***
//========================================
#ifndef _UI_ITEMICON_00_H_	// このマクロ定義がされていなかった時
#define _UI_ITEMICON_00_H_	// 二重インクルード防止のマクロを定義する

#include "main.h"

//****************************************
// プロトタイプ宣言
//****************************************
// UI:アイテムアイコン[00] の初期化処理
// UI:アイテムアイコン[00] の終了処理
// UI:アイテムアイコン[00] の更新処理
// UI:アイテムアイコン[00] の描画処理
void InitUi_itemIcon_00(void);
void UninitUi_itemIcon_00(void);
void UpdateUi_itemIcon_00(void);
void DrawUi_itemIcon_00(void);

#endif