//========================================
// 
// UI:入力ガイド[00] のヘッダファイル
// Author:RIKU NISHIMURA
// 
//========================================
// *** ui_input-guid_00.h ***
//========================================
#ifndef _UI_INPUTGUID_00_H_	// このマクロ定義がされていなかった時
#define _UI_INPUTGUID_00_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// プロトタイプ宣言
//****************************************
// UI:入力ガイド[00] の初期化処理
// UI:入力ガイド[00] の終了処理
// UI:入力ガイド[00] の更新処理
// UI:入力ガイド[00] の描画処理
void InitUi_inputGuid_00(void);
void UninitUi_inputGuid_00(void);
void UpdateUi_inputGuid_00(void);
void DrawUi_inputGuid_00(void);

#endif