//========================================
// 
// 文字列関連処理
// Author:RIKU NISHIMURA
// 
//========================================
// *** print.cpp ***
//========================================
// R.N.Lib
#include "../../R.N.Lib.h"

//================================================================================
//----------|---------------------------------------------------------------------
//==========| hファイルの共有関数
//----------|---------------------------------------------------------------------
//================================================================================

//========================================
// CreateText関数 - 引数に入力された文字列のポインタを返す -
// Author:RIKU NISHIMURA
//========================================
char *CreateText(const char* format, ...) {
	va_list args;  // 可変長引数のためのリスト
	int size;
	char* buffer = NULL;

	va_start(args, format);  // 可変長引数の処理を始める

	 // 出力する文字列のサイズを取得する
	size = vsnprintf(NULL, 0, format, args);
	va_end(args);  // 可変長引数の処理を終了する

	// 文字列のサイズに合わせたメモリを動的に確保する
	buffer = (char*)malloc(size + 1);

	va_start(args, format);  // 可変長引数の処理を再度始める
	vsprintf(buffer, format, args);  // バッファに文字列を書き込む
	va_end(args);  // 可変長引数の処理を終了する

	return buffer;  // 文字列のポインタを返す
}