//========================================
// 
// イージング処理のヘッダファイル
// Author:RIKU NISHIMURA
// 
//========================================
//  *** chunk.h ***
//========================================
#ifndef _CHUNK_H_	// このマクロ定義がされていなかった時
#define _CHUNK_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// クラス定義
//****************************************
// 補間番号
typedef enum {
	EASE_LINEAR,	// 等速
	EASE_IN,		// 徐々に加速
	EASE_OUT,		// 徐々に減速
	EASE_INOUT,		// 加速して減速
	EASE_MAX,
}EASE;

//****************************************
// プロトタイプ宣言
//****************************************
// カウントに応じた数値補間処理
float Easing(const EASE ease, const int nCount, const int nCountMax);

#endif