//========================================
// 
// モードの処理
// Author:RIKU NISHIMURA
// 
//========================================
// *** mode.cpp ***
//========================================
// _R.N.Lib
#include "../R.N.Lib/RNmain.h"
// >Writable
#include "mode.h"

//================================================================================
//----------|---------------------------------------------------------------------
//==========| hファイルの共有関数
//----------|---------------------------------------------------------------------
//================================================================================

//============================================================
//--------------------| *** 基本接続 *** |--------------------
//============================================================
//========================================
// ModeInit関数 - モードに応じた初期化処理 -
// Author:RIKU NISHIMURA
//========================================
void ModeInit(MODE mode)
{
	switch (mode)
	{
	case MODE_MAIN:InitMd_main(); break;
	}
}

//========================================
// ModeUninit関数 - モードに応じた終了処理 -
// Author:RIKU NISHIMURA
//========================================
void ModeUninit(MODE mode)
{
	switch (mode)
	{
	case MODE_MAIN:UninitMd_main(); break;
	}
}

//========================================
// ModeUpdate関数 - モードに応じた更新処理 -
// Author:RIKU NISHIMURA
//========================================
void ModeUpdate(MODE mode)
{
	switch (mode)
	{
	case MODE_MAIN:UpdateMd_main(); break;
	}
}

//========================================
// ModeDraw関数 - モードに応じた描画処理 -
// Author:RIKU NISHIMURA
//========================================
void ModeDraw(MODE mode)
{
	switch (mode)
	{
	case MODE_MAIN:DrawMd_main(); break;
	}
}