//========================================
// 
// HPバー[00] のヘッダファイル
// Author:RIKU NISHIMURA
// 
//========================================
// *** ui_hp-bar_00.h ***
//========================================
#ifndef _UI_HPBAR_00_H_	// このマクロ定義がされていなかった時
#define _UI_HPBAR_00_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// プロトタイプ宣言
//****************************************
// HPバー[00] の初期化処理
// HPバー[00] の終了処理
// HPバー[00] の更新処理
// HPバー[00] の描画処理
void InitUi_hpBar_00(void);
void UninitUi_hpBar_00(void);
void UpdateUi_hpBar_00(void);
void DrawUi_hpBar_00(void);

#endif