//========================================
// 
// UI:タイトルロゴ[00] のヘッダファイル
// Author:RIKU NISHIMURA
// 
//========================================
// *** ui_title-logo_00.h ***
//========================================
#ifndef _UI_TITLELOGO_00_H_	// このマクロ定義がされていなかった時
#define _UI_TITLELOGO_00_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// プロトタイプ宣言
//****************************************
// UI:タイトルロゴ[00] の初期化処理
// UI:タイトルロゴ[00] の終了処理
// UI:タイトルロゴ[00] の更新処理
// UI:タイトルロゴ[00] の描画処理
void InitUi_titleLogo_00(void);
void UninitUi_titleLogo_00(void);
void UpdateUi_titleLogo_00(void);
void DrawUi_titleLogo_00(void);

#endif