//========================================
// 
// カメラ(3D)の操作処理のヘッダファイル
// Author:RIKU NISHIMURA
// 
//========================================
// *** camera3D_control.h ***
//========================================
#ifndef _CAMERA3D_CONTROL_H_	// このマクロ定義がされていなかった時
#define _CAMERA3D_CONTROL_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// プロトタイプ宣言
//****************************************
// カメラ(3D)の状態に応じた操作処理
/* GRAB_AIR_MOUSE */void Camera3DControl_GRAB_AIR_MOUSE(Camera3D *pCamera3D);

#endif