//========================================
// *** ui_area_gage_00.h ***
//========================================
#ifndef _UI_AREA_GAGE_00_H_	// このマクロ定義がされていなかった時
#define _UI_AREA_GAGE_00_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// プロトタイプ宣言
//****************************************

// エリアゲージ[00] の初期化処理
void InitUi_area_gage_00(void);

// エリアゲージ[00] の終了処理
void UninitUi_area_gage_00(void);

// エリアゲージ[00] の更新処理
void UpdateUi_area_gage_00(void);

// エリアゲージ[00] の描画処理
void DrawUi_area_gage_00(void);

#endif