//========================================
// 
// フォグのヘッダファイル
// Author:RIKU NISHIMURA
// 
//========================================
//  *** fog.h ***
//========================================
#ifndef _FOG_H_	// このマクロ定義がされていなかった時
#define _FOG_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// 構造体の宣言
//****************************************
// フォグの設定情報構造体
typedef struct {
	Color col = INITCOLOR;	// 色
	int nStart = 0;	// 開始距離
	int nEnd = 0;	// 終了距離
#if /* 設定フォーマット */0
	// フォグの設定情報
	FogSet fogSet;
	/* 色       */fogSet.col = ;
	/* 開始距離 */fogSet.nStart = ;
	/* 終了距離 */fogSet.nEnd = ;
	// フォグの設定処理
	SetFog(fogSet);
#endif
}FogSet;

// フォグの情報構造体
typedef struct {
	bool bUse = false;	// 使用されているかフラグ
}Fog;

//****************************************
// プロトタイプ宣言
//****************************************
//========== *** 取得 ***
// フォグの情報を取得
Fog *GetFog(void);
//========== *** 設定 ***
// フォグの設定処理
void SetFog(FogSet fogSet);
// フォグの有効無効設定
void EnableFog(bool bEnable);

#endif