//========================================
// 
// BG:宇宙[00] の処理のヘッダファイル
// Author:RIKU NISHIMURA
// 
//========================================
//  *** bg_space_00.h ***
//========================================
#ifndef _BG_SPACE_00_H_	// このマクロ定義がされていなかった時
#define _BG_SPACE_00_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// プロトタイプ宣言
//****************************************
// BG:宇宙[00] の初期化処理
// BG:宇宙[00] の終了処理
// BG:宇宙[00] の更新処理
// BG:宇宙[00] の描画処理
void InitBg_space_00(void);
void UninitBg_space_00(void);
void UpdateBg_space_00(void);
void DrawBg_space_00(void);

#endif