//========================================
// 
// UI:フレーム[00] のヘッダファイル
// Author:RIKU NISHIMURA
// 
//========================================
// *** ui_frame_00.h ***
//========================================
#ifndef _UI_FRAME_00_H_	// このマクロ定義がされていなかった時
#define _UI_FRAME_00_H_	// 二重インクルード防止のマクロを定義する

#include "main.h"

//****************************************
// プロトタイプ宣言
//****************************************
// UI:フレーム[00] の初期化処理
void InitUi_frame_00(void);
// UI:フレーム[00] の終了処理
void UninitUi_frame_00(void);
// UI:フレーム[00] の更新処理
void UpdateUi_frame_00(void);
// UI:フレーム[00] の描画処理
void DrawUi_frame_00(void);
// UI:フレーム[00] の設定処理
void SetUi_frame_00(void);

#endif