//========================================
// *** ui_arrow_00.h ***
//========================================
#ifndef _UI_ARROW_00_H_	// このマクロ定義がされていなかった時
#define _UI_ARROW_00_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// 構造体の定義
//****************************************

// 矢印[00] の情報構造体
typedef struct
{
	D3DXVECTOR3	pos;	// 位置
	bool		bUse;	// 使用されているかフラグ
}Ui_arrow_00;

//****************************************
// プロトタイプ宣言
//****************************************

// 矢印[00] の情報を取得
Ui_arrow_00 *GetUi_arrow_00(void);

// 矢印[00] の初期化処理
void InitUi_arrow_00(void);

// 矢印[00] の終了処理
void UninitUi_arrow_00(void);

// 矢印[00] の更新処理
void UpdateUi_arrow_00(void);

// 矢印[00] の描画処理
void DrawUi_arrow_00(void);

#endif