//========================================
// 
// ファイル関連の処理
// Author:RIKU NISHIMURA
// 
//========================================
//  *** file.h ***
//========================================
#ifndef _FILE_H_	// このマクロ定義がされていなかった時
#define _FILE_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// プロトタイプ宣言
//****************************************
//========== *** 取得 ***
// 開くファイルを選択し取得
bool OpenFile(char *pFileName, char *pInitDir, char *pFileType);
// 保存するファイルを選択し取得
bool SaveFile(char *pFileName, char *pInitDir, char *pFileType);

#endif