//========================================
// 
// テクスチャ関連のヘッダファイル
// Author:RIKU NISHIMURA
// 
//========================================
//  *** texture.h ***
//========================================
#ifndef _TEXTURE_H_	// このマクロ定義がされていなかった時
#define _TEXTURE_H_	// 二重インクルード防止のマクロを定義する

//****************************************
// プロトタイプ宣言
//****************************************
//========== *** 基本接続 ***
// テクスチャの終了処理
void UninitTexture(void);
//========== *** 入出力 ***
// テクスチャの読み込み処理
int LoadTexture(char *pTexturePath);
//========== *** 設定 ***
// テクスチャの設定処理
void SetTexture(LPDIRECT3DDEVICE9 pDevice, int nTex);

#endif